// const stars = parseInt  (prompt("введіть рейтинг готелю"))
// switch (stars) {
//     case 1:
//         alert("вартість номеру 200")
//         break;
//     case 2:
//         alert("вартість номеру 100")
//         break;
//     case 3:
//         alert("вартість номеру 50")

//     default:
//         break;
// }

//1. Напиши скрипт вибору опції доставки товару. Опція зберігається в змінній option: 1 - самовивіз, 2 - кур"єр, 3 - пошта. В змінну message записати повідомлення в залежності від опції:

// 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
// 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
// 'Посилка буде відправлена сьогодні'
// 'Вам передзвонить менеджер'.
// let message = "";
// const takeof = "Ви зможете забрати товар завтра з 12:00 в нашому офісі";
// const curir = 'Кур"єр доставить замовлення завтра з 9:00 до 18:00';
// const send = "Посилка буде відправлена сьогодні";
// const call = "Вам передзвонить менеджер";
// const option = Number(prompt("1 - самовивіз, 2 - кур`єр, 3 - пошта"));
// switch (option) {
//     case 1:
//         message = takeof
//         break;
//     case 2:
//         message = curir
//         break;
//     case 3:
//         message = send
//         break;
//     default:
//         message = call
//         break;
// }
// if (option === 1) {
//   message = takeof;
// } else if (option === 2) {
//   message = curir;
// } else if (option === 3) {
//   message = send;
// } else {
//   message = call;
// }

// console.log(message);


// //Написати програму яка перевіряє чи введене число через input потрапляє в діапазон від 55 до 99 включно. Якщо так, вивести на екран "Число потрапляє в діапазон". Якщо ні, вивести "Число не потрапляє в діапазон"
// const num = prompt("введіть число")
// console.log(num);

// if(умова){//якщо 

// } else if(умова){//тоді якщо

// } else if(умова){//тоді якщо

// }else if(умова){//тоді якщо

// }else (умова){//тоді 
    
// }

// if(num > 55 && num < 99){ 
// alert("Число потрапляє в діапазон")
// } 

//Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100). До якої групи відноситься Максимчик, якщо йому 55 років. Назву групи вивести на екран.
// let group = "";
// const age = 101;

// if(age >= 0 && age <= 16){  
//     group = "діти"
// }else if(age >= 17 && age <= 60){
//     group = "дорослі"
// }else if(age >= 61 && age <= 100){
//     group = "пенсіонери"
// }else if(age > 100){
//     group = "трухлявий"
// }
// console.log(group);


//Якщо ваше ім’я містить більше 4 букв і прізвище більше 5, то виведіть на екран число,яке дорівнює сумі букв імені і прізвища. Якщо умова не виконується - вивести “УПС”. Наприклад: “Віктор Сташко” Віктор - 6 літер, Сташко - 6 літер. Виводимо 12. Використовувати вбудований метод length.

// const userName = prompt("введіть своє ім'я")
// const surName = prompt("введіть своє прізвище")

// if (userName.lenght > 4 && surName.length > 5){
//     console.log(useName.length + surName.length);
    
    
// } else {
//     alert("упс")
// }

//Виберіть будь-яке число від 1 до 5 включно через функцію random. За допомогою if else визначіть, що це за число.