//Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
let counter = 0;
while (counter < 10) {
    counter += 1;
  console.log(counter);
  
}

//Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
for (let i = 2; i <= 20; i +=1) {
  if (i % 2 !== 0) {
    continue; 
  }
  console.log(i);
}


//Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
for (let i = 1; i <= 10; i += 1) {
  console.log(`7 x ${i} = ${7 * i}`);
}


//Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let i = 0;
while (i <8){
    i += 1; 
    if (i >3){
        break
    }
    console.log(i);
    
}

//За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
// let i = 1;
// while (i <= 20) {
//   if (i % 3 === 0) {
//     i++; 
//     continue; 
//   }
//   console.log(i);
//   i++;
// }